---
title: ExportLineweightTable
classe: Autodesk.Revit.DB.ExportLineweightTable
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# ExportLineweightTable

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `exportLineweightTable.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `exportLineweightTable.IsValidObject` | Boolean |
| `ExportLineweightInfo Item { get; set; }` | `exportLineweightTable.Item` | ExportLineweightInfo |
| `Void Add(ExportLineweightKey, ExportLineweightInfo)` | `exportLineweightTable.Add(exportLineweightKey, exportLineweightInfo)` | Void |
| `Void Clear()` | `exportLineweightTable.Clear()` | Void |
| `Boolean ContainsKey(ExportLineweightKey)` | `exportLineweightTable.ContainsKey(exportLineweightKey)` | Boolean |
| `Void Dispose()` | `exportLineweightTable.Dispose()` | Void |
| `IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>> GetEnumerator()` | `exportLineweightTable.GetEnumerator()` | IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>> |
| `ExportLineweightInfo GetExportLineweightInfo(ExportLineweightKey)` | `exportLineweightTable.GetExportLineweightInfo(exportLineweightKey)` | ExportLineweightInfo |
| `IList<ExportLineweightKey> GetKeys()` | `exportLineweightTable.GetKeys()` | IList<ExportLineweightKey> |
| `ExportLineweightTableIterator GetLineweightTableIterator()` | `exportLineweightTable.GetLineweightTableIterator()` | ExportLineweightTableIterator |
| `IList<ExportLineweightInfo> GetValues()` | `exportLineweightTable.GetValues()` | IList<ExportLineweightInfo> |
| `Void Remove(ExportLineweightKey)` | `exportLineweightTable.Remove(exportLineweightKey)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```